# Advanced Methods

In [1]:
import pandas as pd

The following dataframes will be used throughout this section.

In [3]:
df1 = pd.DataFrame({'1C1':[3,4,5], '1C2':[30,40,50], 'col':[300,400,500]}, index=['A', 'B', 'C'])
df1

   1C1  1C2  col
A    3   30  300
B    4   40  400
C    5   50  500

In [15]:
df2 = pd.DataFrame({'2C1':[5,6,9], '2C2':[50,60,90]}, index=['A', 'B', 'C'])
df2

   2C1  2C2
A    5   50
B    6   60
C    9   90

In [16]:
df3 = pd.DataFrame({'3C1':[7,8], '3C2':[70,80], 'col':[700,800]}, index=['C', 'D'])
df3

   3C1  3C2  col
C    7   70  700
D    8   80  800

## concat()
It is used to concatenate dataframes along an axis (horizontally or vertically).

In [18]:
# default axis=0: add as new rows
# two new rows coming from df3: C and D
pd.concat([df1,df3])

   1C1   1C2  col  3C1   3C2
A  3.0  30.0  300  NaN   NaN
B  4.0  40.0  400  NaN   NaN
C  5.0  50.0  500  NaN   NaN
C  NaN   NaN  700  7.0  70.0
D  NaN   NaN  800  8.0  80.0

In [20]:
# axis=1, add as new columns
# three more rows are coming from df3: 3C1, 3C2, col 
pd.concat([df1,df3], axis=1)

   1C1   1C2    col  3C1   3C2    col
A  3.0  30.0  300.0  NaN   NaN    NaN
B  4.0  40.0  400.0  NaN   NaN    NaN
C  5.0  50.0  500.0  7.0  70.0  700.0
D  NaN   NaN    NaN  8.0  80.0  800.0

In [13]:
# along only on common columns
pd.concat([df1,df2], join='inner')   # intersection of columns

   col
A  300
B  400
C  500
C  700
D  800

- If the indexes of two dataframes are the same, the column labels are different, and axis=1, then the second dataframe is concatenated horizontally.

In [21]:
# default axis=1: add as a new row
pd.concat([df1,df2], axis=1)

   1C1  1C2  col  2C1  2C2
A    3   30  300    5   50
B    4   40  400    6   60
C    5   50  500    9   90